turbq/atprog/packs/atmel/SAM3S_DFP/1.0.70/sam3s/atdf/ATSAM3S4C.atdf
        <register caption="CRCCU DMA Enable Register" name="CRCCU_DMA_EN" offset="0x00000008" rw="W" size="4">
          <bitfield caption="DMA Enable Register" mask="0x00000001" name="DMAEN"/>
        </register>
        <register caption="CRCCU DMA Disable Register" name="CRCCU_DMA_DIS" offset="0x0000000C" rw="W" size="4">
          <bitfield caption="DMA Disable Register" mask="0x00000001" name="DMADIS"/>
        </register>
        <register caption="CRCCU DMA Status Register" name="CRCCU_DMA_SR" offset="0x00000010" rw="R" size="4">
          <bitfield caption="DMA Status Register" mask="0x00000001" name="DMASR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Enable Register" name="CRCCU_DMA_IER" offset="0x00000014" rw="W" size="4">
          <bitfield caption="Interrupt Enable register" mask="0x00000001" name="DMAIER"/>
        </register>
        <register caption="CRCCU DMA Interrupt Disable Register" name="CRCCU_DMA_IDR" offset="0x00000018" rw="W" size="4">
          <bitfield caption="Interrupt Disable register" mask="0x00000001" name="DMAIDR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Mask Register" name="CRCCU_DMA_IMR" offset="0x0000001C" rw="R" size="4">
          <bitfield caption="Interrupt Mask Register" mask="0x00000001" name="DMAIMR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Status Register" name="CRCCU_DMA_ISR" offset="0x00000020" rw="R" size="4">
          <bitfield caption="Interrupt Status register" mask="0x00000001" name="DMAISR"/>
        </register>
        <register caption="CRCCU Control Register" name="CRCCU_CR" offset="0x00000034" rw="W" size="4">
          <bitfield caption="CRC Computation Reset" mask="0x00000001" name="RESET"/>
        </register>
        <register caption="CRCCU Mode Register" name="CRCCU_MR" offset="0x00000038" rw="RW" size="4">
          <bitfield caption="CRC Enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="CRC Compare" mask="0x00000002" name="COMPARE"/>
          <bitfield caption="Primitive Polynomial" mask="0x0000000C" name="PTYPE" values="CRCCU_MR__PTYPE"/>
          <bitfield caption="Request Divider" mask="0x000000F0" name="DIVIDER"/>
        </register>
        <register caption="CRCCU Status Register" name="CRCCU_SR" offset="0x0000003C" rw="R" size="4">
          <bitfield caption="Cyclic Redundancy Check Value" mask="0xFFFFFFFF" name="CRC"/>
        </register>
        <register caption="CRCCU Interrupt Enable Register" name="CRCCU_IER" offset="0x00000040" rw="W" size="4">
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00000001" name="ERRIER"/>
        </register>
        <register caption="CRCCU Interrupt Disable Register" name="CRCCU_IDR" offset="0x00000044" rw="W" size="4">
          <bitfield caption="CRC Error Interrupt Disable" mask="0x00000001" name="ERRIDR"/>
        </register>
        <register caption="CRCCU Interrupt Mask Register" name="CRCCU_IMR" offset="0x00000048" rw="R" size="4">
          <bitfield caption="CRC Error Interrupt Mask" mask="0x00000001" name="ERRIMR"/>
        </register>
        <register caption="CRCCU Interrupt Status Register" name="CRCCU_ISR" offset="0x0000004C" rw="R" size="4">
          <bitfield caption="CRC Error Interrupt Status" mask="0x00000001" name="ERRISR"/>
        </register>
      </register-group>
      <value-group caption="" name="CRCCU_MR__PTYPE">
        <value caption="Polynom 0x04C11DB7" name="CCITT8023" value="0x0"/>
        <value caption="Polynom 0x1EDC6F41" name="CASTAGNOLI" value="0x1"/>
        <value caption="Polynom 0x1021" name="CCITT16" value="0x2"/>
      </value-group>
    </module>
    <module caption="Digital-to-Analog Converter Controller" name="DACC" version="6461G">
      <register-group name="DACC">
        <register caption="Control Register" name="DACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="DACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="DACC_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="DACC_MR__TRGSEL"/>
          <bitfield caption="Word Transfer" mask="0x00000010" name="WORD" values="DACC_MR__WORD"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="DACC_MR__SLEEP"/>
          <bitfield caption="Fast Wake up Mode" mask="0x00000040" name="FASTWKUP" values="DACC_MR__FASTWKUP"/>
          <bitfield caption="Refresh Period" mask="0x0000FF00" name="REFRESH"/>
          <bitfield caption="User Channel Selection" mask="0x00030000" name="USER_SEL" values="DACC_MR__USER_SEL"/>
          <bitfield caption="Tag Selection Mode" mask="0x00100000" name="TAG" values="DACC_MR__TAG"/>
          <bitfield caption="Max Speed Mode" mask="0x00200000" name="MAXS" values="DACC_MR__MAXS"/>
          <bitfield caption="Startup Time Selection" mask="0x3F000000" name="STARTUP" values="DACC_MR__STARTUP"/>
        </register>
        <register caption="Channel Enable Register" name="DACC_CHER" offset="0x10" rw="W" size="4">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
        </register>
        <register caption="Channel Disable Register" name="DACC_CHDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
        </register>
        <register caption="Channel Status Register" name="DACC_CHSR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
        </register>
        <register caption="Conversion Data Register" name="DACC_CDR" offset="0x20" rw="W" size="4">
          <bitfield caption="Data to Convert" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="Interrupt Enable Register" name="DACC_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="Transmit Ready Interrupt Enable" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of Conversion Interrupt Enable" mask="0x00000002" name="EOC"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000008" name="TXBUFE"/>
        </register>
        <register caption="Interrupt Disable Register" name="DACC_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="Transmit Ready Interrupt Disable." mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of Conversion Interrupt Disable" mask="0x00000002" name="EOC"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00000008" name="TXBUFE"/>
        </register>
        <register caption="Interrupt Mask Register" name="DACC_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Transmit Ready Interrupt Mask" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of Conversion Interrupt Mask" mask="0x00000002" name="EOC"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00000008" name="TXBUFE"/>
        </register>
