turbq/atprog/packs/atmel/SAM3S_DFP/1.0.70/sam3s/atdf/ATSAM3S4C.atdf
      <value-group caption="" name="SUPC_WUIR__WKUPT2">
        <value caption="a high to low level transition for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH_TO_LOW" value="0"/>
        <value caption="a low to high level transition for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="LOW_TO_HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT3">
        <value caption="a high to low level transition for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH_TO_LOW" value="0"/>
        <value caption="a low to high level transition for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="LOW_TO_HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT4">
        <value caption="a high to low level transition for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH_TO_LOW" value="0"/>
        <value caption="a low to high level transition for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="LOW_TO_HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT5">
        <value caption="a high to low level transition for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH_TO_LOW" value="0"/>
        <value caption="a low to high level transition for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="LOW_TO_HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT6">
        <value caption="a high to low level transition for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH_TO_LOW" value="0"/>
        <value caption="a low to high level transition for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="LOW_TO_HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT7">
        <value caption="a high to low level transition for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH_TO_LOW" value="0"/>
        <value caption="a low to high level transition for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="LOW_TO_HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT8">
        <value caption="a high to low level transition for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH_TO_LOW" value="0"/>
        <value caption="a low to high level transition for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="LOW_TO_HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT9">
        <value caption="a high to low level transition for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH_TO_LOW" value="0"/>
        <value caption="a low to high level transition for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="LOW_TO_HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT10">
        <value caption="a high to low level transition for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH_TO_LOW" value="0"/>
        <value caption="a low to high level transition for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="LOW_TO_HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT11">
        <value caption="a high to low level transition for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH_TO_LOW" value="0"/>
        <value caption="a low to high level transition for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="LOW_TO_HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT12">
        <value caption="a high to low level transition for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH_TO_LOW" value="0"/>
        <value caption="a low to high level transition for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="LOW_TO_HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT13">
        <value caption="a high to low level transition for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH_TO_LOW" value="0"/>
        <value caption="a low to high level transition for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="LOW_TO_HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT14">
        <value caption="a high to low level transition for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH_TO_LOW" value="0"/>
        <value caption="a low to high level transition for a period defined by WKUPDBC on the correspond-ing wake-up input forces the wake-up of the core power supply." name="LOW_TO_HIGH" value="1"/>
      </value-group>
