turbq/atprog/packs/atmel/SAM3S_DFP/1.0.70/sam3s/atdf/ATSAM3S4C.atdf
        <register caption="Interrupt Mask Register" name="US_IMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Mask" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of Receive Transfer Interrupt Mask (available in all USART modes of operation)" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmit Interrupt Mask (available in all USART modes of operation)" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Mask" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000080" name="PARE"/>
          <bitfield caption="Time-out Interrupt Mask" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Mask" mask="0x00000400" name="ITER"/>
          <bitfield caption="Buffer Empty Interrupt Mask (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Buffer Full Interrupt Mask (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non AcknowledgeInterrupt Mask" mask="0x00002000" name="NACK"/>
          <bitfield caption="Ring Indicator Input Change Mask" mask="0x00010000" name="RIIC"/>
          <bitfield caption="Data Set Ready Input Change Mask" mask="0x00020000" name="DSRIC"/>
          <bitfield caption="Data Carrier Detect Input Change Interrupt Mask" mask="0x00040000" name="DCDIC"/>
          <bitfield caption="Clear to Send Input Change Interrupt Mask" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Manchester Error Interrupt Mask" mask="0x01000000" name="MANE"/>
        </register>
        <register caption="Channel Status Register" name="US_CSR" offset="0x0014" rw="R" size="4">
          <bitfield caption="Receiver Ready" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Break Received/End of Break" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmitter Transfer" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error" mask="0x00000080" name="PARE"/>
          <bitfield caption="Receiver Time-out" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Transmitter Empty" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached" mask="0x00000400" name="ITER"/>
          <bitfield caption="Transmission Buffer Empty" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Reception Buffer Full" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non AcknowledgeInterrupt" mask="0x00002000" name="NACK"/>
          <bitfield caption="Ring Indicator Input Change Flag" mask="0x00010000" name="RIIC"/>
          <bitfield caption="Data Set Ready Input Change Flag" mask="0x00020000" name="DSRIC"/>
          <bitfield caption="Data Carrier Detect Input Change Flag" mask="0x00040000" name="DCDIC"/>
          <bitfield caption="Clear to Send Input Change Flag" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Image of RI Input" mask="0x00100000" name="RI"/>
          <bitfield caption="Image of DSR Input" mask="0x00200000" name="DSR"/>
          <bitfield caption="Image of DCD Input" mask="0x00400000" name="DCD"/>
          <bitfield caption="Image of CTS Input" mask="0x00800000" name="CTS"/>
          <bitfield caption="Manchester Error" mask="0x01000000" name="MANERR"/>
        </register>
        <register caption="Receiver Holding Register" name="US_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000001FF" name="RXCHR"/>
          <bitfield caption="Received Sync" mask="0x00008000" name="RXSYNH"/>
        </register>
        <register caption="Transmitter Holding Register" name="US_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000001FF" name="TXCHR"/>
          <bitfield caption="Sync Field to be Transmitted" mask="0x00008000" name="TXSYNH"/>
        </register>
        <register caption="Baud Rate Generator Register" name="US_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x0000FFFF" name="CD"/>
          <bitfield caption="Fractional Part" mask="0x00070000" name="FP"/>
        </register>
        <register caption="Receiver Time-out Register" name="US_RTOR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="Time-out Value" mask="0x0000FFFF" name="TO"/>
        </register>
        <register caption="Transmitter Timeguard Register" name="US_TTGR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="Timeguard Value" mask="0x000000FF" name="TG"/>
        </register>
        <register caption="FI DI Ratio Register" name="US_FIDI" offset="0x0040" rw="RW" size="4">
          <bitfield caption="FI Over DI Ratio Value" mask="0x0000FFFF" name="FI_DI_RATIO"/>
        </register>
        <register caption="Number of Errors Register" name="US_NER" offset="0x0044" rw="R" size="4">
          <bitfield caption="Number of Errors" mask="0x000000FF" name="NB_ERRORS"/>
        </register>
        <register caption="IrDA Filter Register" name="US_IF" offset="0x004C" rw="RW" size="4">
          <bitfield caption="IrDA Filter" mask="0x000000FF" name="IRDA_FILTER"/>
        </register>
        <register caption="Manchester Encoder Decoder Register" name="US_MAN" offset="0x0050" rw="RW" size="4">
          <bitfield caption="Transmitter Preamble Length" mask="0x0000000F" name="TX_PL"/>
          <bitfield caption="Transmitter Preamble Pattern" mask="0x00000300" name="TX_PP" values="US_MAN__TX_PP"/>
          <bitfield caption="Transmitter Manchester Polarity" mask="0x00001000" name="TX_MPOL"/>
          <bitfield caption="Receiver Preamble Length" mask="0x000F0000" name="RX_PL"/>
          <bitfield caption="Receiver Preamble Pattern detected" mask="0x03000000" name="RX_PP" values="US_MAN__RX_PP"/>
          <bitfield caption="Receiver Manchester Polarity" mask="0x10000000" name="RX_MPOL"/>
          <bitfield caption="Must Be Set to 1" mask="0x20000000" name="ONE"/>
          <bitfield caption="Drift Compensation" mask="0x40000000" name="DRIFT"/>
        </register>
        <register caption="Write Protect Mode Register" name="US_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY." mask="0xFFFFFF00" name="WPKEY" values="US_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="US_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
